// pages/cores/rules/re.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
  re:[
    {id:"1",content:"电子阅览室是专供师生学习、利用网络资源的场所。"},
    {id:"2",content:"读者入室请刷卡登记，严格一人一机。上机前应先检查设备是否完备，如缺损或运行不正常请及时告知管理员。"},
    {id:"3",content:"禁止访问不健康或反动网站，不得在阅览室计算机上玩网络游戏，不得在网上发表不健康的言论和帖子，以及进行黑客攻击，一经发现，严肃处理。"},
   { id:"4",content:"爱护本室设施、设备，读者在使用过程中如设备出现故障，需告知管理人员修理，不得自行修理。禁止修改计算机配置文件、删除或修改系统文件、格式化硬盘，设备如有损坏，按规定赔偿。"},
    {id:"5",content:"必须严格遵守国家及学校有关利用互联网管理的各项规定。"}
  ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})