// pages/cores/rules/rh/rh.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    rh:[
      {id:"1",content:"为了学习、教学和科学研究的需要，以正常速度检索、浏览、下载或打印电子资源。"},
      {id:"2",content:"严禁利用任何软件工具或其它非正常手段批量下载图书馆购买的电子资源（包括EndNote 等文献管理软件的自动批量下载功能）。"},
     { id:"3",content:"切勿连续、系统、集中下载电子资源或整本下载电子期刊。"},
     { id:"4",content:"注意保护个人网络账号，不得将个人网络账号提供给校外人员使用本校电子资源，不得利用获得的文献资料进行商业牟利。"},
      {id:"5",content:"对违规行为，图书馆将视情节轻重，给予违规者相应处理。1）违规者须向图书馆提交书面陈述和检查，并保证今后不再发生类似违规行为。      2）违规者应在图书馆、所在院系的有关人员的监督下删除恶意下载的文献。      3）违规使用，数据商将禁止违规者使用电子资源权限。时限视情节轻重而定。      4）由违规者自行承担因违规行为而引起的知识产权纠纷和法律责任。"}
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})