// pages/cores/rules/rg.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    rg:[
      {id:"1",content:"图书馆可借出的文献包括一般中外文图书（馆藏地址是徐汇中文书库、徐汇外国教材中心、奉贤新馆中文书库、奉贤新馆外文书库），随书光盘以及徐汇社科图书阅览室、徐汇信息语言图书阅览室、徐汇科技图书阅览室图书，徐汇阅览室图书提供短期借阅；各阅览室的期刊、参考工具书、学位论文、报纸等不予外借。"},
     { id:"2 借书",content:"1）借书册数：本科学生借书册数12册，教职工、研究生借书册数24册，退休教职工借书册数12册, 工程硕士借书册数10册, 本校临时教工、继续教育学院本专科生借书册数5册。上述人员均可借随书光盘2盘，借期一天。2）借书期限：本科学生借书期限为30天，教职工、研究生借书期限为60天，超期罚款，每天0.02元。具体借阅权限见表。3）所借图书须凭本人校园卡在自助借还机上办理借出手续，若有问题请与服务台联系。 4）读者借阅文献时应当场检查，如发现污损等情况，应及时提请工作人员记录处理。读者对所借图书应爱护保管，如有污损、缺页、遗失等情况，按相关规定赔偿。5）请勿将未办理借阅手续的图书带出图书馆。"},
     {id:"3 归还和续借",content:
"1）读者借阅的图书应按期在自助借还机上归还，若有问题请与服务台联系，逾期不还者按相关规定处理。 2）图书逾期前如需继续使用，可办理续借手续。未被其他读者预约的图书可续借2次，已被其他读者预约的图书或逾期的图书不能续借。续借手续可自行在网上办理3）寒假和暑假期内到期的图书，归还前不能借阅其他图书，读者可在开学后第一周内到图书馆归还，由此而产生的逾期费用系统会自动免去。 4)图书遗失，需及时挂失。"},
 { id:"4 预约",content:
"1) 读者可根据需要自行在网上预约“借出”状态的图书或本校区图书馆没有的图书。2) 每位读者可预约图书2册（随书光盘暂不提供预约），预约的有效天数为30天，即30天内没有到书，该条记录会自动取消。3) 预约图书回馆后，图书馆将以Email或短信的方式通知读者，读者也可以在'我的图书馆'中查到自己预约图书的状态。4）预约图书将在预约架上保留7天（寒、暑假除外），逾期自动取消。5）开通预约服务：读者必须提供有效的邮箱地址和手机号码，在总咨询台人工开通或者在“我的图书馆”完善个人资料后由系统自动开通。6）预约取消：如果需要取消对某本图书的预约，直接在“我的图书馆”中操作。但已经到书的预约信息不能取消。7）取消预约资格：未按时前来借阅已经到库的预约图书，累计三次，过3个月系统自动恢复预约资格。"}


    ]
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
