// pages/cores/rules/rc.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
  rc:[
      { id:"1",content:"借阅证（校园卡）只限本人使用，不得代借、冒借，违者停止借阅权限2个月。"},
      {id:"2",content:"读者未经图书馆同意或未办理借阅手续，擅自将文献带出图书馆，视为严重违规。图书馆有权对其进行批评教育，并提交书面检查报告，停止借阅权限两周，严重违规累计两次者，永久取消阅览权限。"},
      {id:"3",content:"经查实属偷窃图书馆公物（包括各类文献、设备等），按原物品价格的10—20倍处罚(不满10元的，以10元计) ，停止借阅权限六个月，非本校读者收回借书证或阅览证，并通报本人所在单位。" },
   { id:"4",content:"外借图书逾期归还者，须支付逾期费。普通借阅逾期费为0.02元 / 天 / 册，阅览室短期借阅逾期费为0.5元 / 天 / 册，最高限额10元。若有读者预约请求时，图书馆将通过手机短信和E - mail对超期持书读者发图书催还通知，持书读者应及时还书。读者到外地出差、实习，应及时归还图书或办理续借手续。逾期未还图书时，出示所在单位书面证明，可按实际情况酌情处理。" },
  ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})