// pages/cores/rules/rf.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
      rf:[
        {id:"1",content:"图书馆内的书包箱仅用于读者暂时存放一般物品及书包，书包箱存放时间为每天8: 00～22: 00（徐汇）, 8: 00~23: 00（奉贤）。"} ,
        {id:"2",content:"为保证个人财产安全，贵重物品请随身携带，本馆对所放置的物品不负保管责任。"},
       {id:"3",content:"书包箱内禁止存放易燃、易爆、有异味、易腐烂等物品及危险品。"},
       {id:"4",content:"读者离馆时务必取走书包箱内的个人物品，以便于其他读者使用。"},
       {id:"5",content:"闭馆后书包箱将被开启进行统一清理，清理时如发现书包箱占用，图书馆有权处理，无保管义务，如有物品遗失，责任自负。"},
       {id:"6",content:"徐汇图书馆4楼书包箱11月～12月为考研学生专用，考研期间不受第5条限制。到期后请将书包箱清空并保持清洁，书包箱内若留有物品，本馆将视为弃物处理。"}
      ]
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
