// pages/cores/rules/ra.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    ra:[
     {id:"1",content:"校内读者凭本人有效校园卡刷卡入馆；校外人员来馆，须联系相关人员并出示本人有效证件，在值班处登记后进馆。"},
      { id: "2", content: "读者应遵守图书馆规章制度，爱护文献资料和设施设备。" },
      { id: "3", content: " 图书馆为重点防火单位，严禁在馆内任何地方吸烟、用火。" },
      { id: "4", content: "进入图书馆应注意着装整齐、举止文明，礼貌待人，禁止有碍观瞻行为。" },
      { id: "5", content: "保持图书馆内安静，手机或电脑等设备调至静音。禁止在馆内喧哗、朗读或大声接打手机。" },
      { id: "6", content: "遵守并维护馆内秩序，不用物品抢占阅览座位，离馆时带离个人物品(包括书籍), 并把椅子放回原处；禁止携带食品进入图书馆，保持馆内清洁卫生，禁止随地吐痰，乱扔废弃物。" },
      { id: "7", content: "未经图书馆同意，不准在馆内随意张贴各类海报，或使用个人携带的设备进行摄像及其他活动。" },
      { id: "8", content: "禁止携带未办理借阅手续的图书或期刊出馆。" },
      { id: "9", content: "禁止在图书馆内私拉电线，比如插座、台灯及电暖宝等物品。" },
      { id: "10", content: "出馆时所有人员一律走监测仪通道。如遇监测器报警，请主动配合工作人员的检查。" },
      { id: "11", content: "对违反上述规定的读者，任何人有权批评和制止其行为。情节严重者报学校有关部门进行处理。" },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})