// pages/cores/rules/rb.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
  rb:[
    {
      id:"1",content:"本校教职工及研究生、本科生由图书馆统一开通校园卡借阅权限，师生可凭校园卡在图书馆借书和阅览。"},
      {id:"2",content:"非全日制学生及进修人员须经所在学院担保，图书馆批准后方可开通借阅权限，集体办证由图书馆统一开通借阅权限，个人办证请至图书馆总服务台办理。其有效期与申请人在校时间一致。"},
    { id: "3", content:"借阅证（校园卡）只限本人使用，不得转借他人，不得使用他人证件。"},
     {id:"4", content:"读者遗失校园卡，如果在图书馆内发现遗失应立即到图书馆服务台办理挂失借阅证功能，并立即到校园卡中心（图书馆服务台只办理挂失借阅证功能）挂失、补办，挂失前被他人借出的图书，由原持证人负责赔偿。"},
    { id: "5", content: "读者离开学校时，须还清所借全部图书，如有图书遗失等情况，须按章赔偿，方可办理离校手续。延期毕业的学生，应持所在院系出具的证明及校园卡到总服务台办理延期手续。"},
  ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})